app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.all.paginate(page: params[:page], per_page: 20)
---
SELECT "subjects".* FROM "subjects"